ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_trng_regs.xml
<module id="HSM_TRNG" HW_revision="" description="HSM TRNG Registers">
	<register id="TRNG_INPUT_0" width="32" page="0" offset="0" internal="0" description="Data input LSW">
		<bitfield id="TRNG_INPUT_0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_OUTPUT_0" width="32" page="0" offset="0" internal="0" description="Data output LSW">
		<bitfield id="TRNG_OUTPUT_0" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="TRNG_INPUT_1" width="32" page="0" offset="4" internal="0" description="Data input">
		<bitfield id="TRNG_INPUT_1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_OUTPUT_1" width="32" page="0" offset="4" internal="0" description="Data output">
		<bitfield id="TRNG_OUTPUT_1" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="TRNG_INPUT_2" width="32" page="0" offset="8" internal="0" description="Data input">
		<bitfield id="TRNG_INPUT_2" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_OUTPUT_2" width="32" page="0" offset="8" internal="0" description="Data output">
		<bitfield id="TRNG_OUTPUT_2" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="TRNG_INPUT_3" width="32" page="0" offset="12" internal="0" description="Data input MSW">
		<bitfield id="TRNG_INPUT_3" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_OUTPUT_3" width="32" page="0" offset="12" internal="0" description="Data output MSW">
		<bitfield id="TRNG_OUTPUT_3" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="TRNG_STATUS" width="32" page="0" offset="16" internal="0" description="status register">
		<bitfield id="READY" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SHUTDOWN_OFLO" description="" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="STUCK_OUT" description="" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="NOISE_FAIL" description="" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="RUN_FAIL" description="" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="LONG_RUN_FAIL" description="" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="POKER_FAIL" description="" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="MONOBIT_FAIL" description="" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="TEST_READY" description="" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="STUCK_NRBG" description="" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="RESEED_AI" description="" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="RESERVED_0" description="" begin="12" end="11" width="2" rwaccess="R"/>
		<bitfield id="REPCNT_FAIL" description="" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="APROP_FAIL" description="" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="TEST_STUCK_OUT" description="" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="BLOCKS_AVAILABLE" description="" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="BLOCKS_THRESH" description="" begin="30" end="24" width="7" rwaccess="R"/>
		<bitfield id="NEED_CLOCK" description="" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="TRNG_INTACK_SECURE_MODE" width="32" page="0" offset="16" internal="0" description="TRNG Interrupt Acknowledge Register">
		<bitfield id="READY" description="" begin="14" end="0" width="15" rwaccess="RW"/>
	</register>
	<register id="TRNG_INTACK" width="32" page="0" offset="16" internal="0" description="TRNG Interrupt Acknowledge Register">
		<bitfield id="READY_ACK" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SHUTDOWN_OFLO_ACK" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="STUCK_OUT_ACK" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="NOISE_FAIL_ACK" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RUN_FAIL_ACK" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LONG_RUN_FAIL_ACK" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="POKER_FAIL_ACK" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MONOBIT_FAIL_ACK" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TEST_READY_ACK" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="STUCK_NRBG_ACK" description="" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="STUCK_OUT_ACK2" description="" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="OPEN_READ_GATE2" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="REPCNT_FAIL_ACK" description="" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="APROP_FAIL_ACK" description="" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TEST_STUCK_OUT" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="BLOCKS_THRESH" description="" begin="30" end="24" width="7" rwaccess="RW"/>
		<bitfield id="LOAD_THRESH" description="" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="TRNG_CONTROL" width="32" page="0" offset="20" internal="0" description="TRNG Control Register">
		<bitfield id="READY_MASK" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SHUTDOWN_OFLO_MASK" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="STUCK_OUT_MASK" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="NOISE_FAIL_MASK" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RUN_FAIL_MASK" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LONG_RUN_FAIL_MASK" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="POKER_FAIL_MASK" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MONOBIT_FAIL_MASK" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TEST_MODE" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="STUCK_NRBG_MASK" description="" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ENABLE_TRNG" description="" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="NO_WHITENING" description="" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="DRBG_EN" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="REPCNT_FAIL_MASK" description="" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="APROP_FAIL_MASK" description="" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="RE_SEED" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="REQUEST_DATA" description="" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="REQUEST_HOLD" description="" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_0" description="" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="DATA_BLOCKS" description="" begin="31" end="20" width="12" rwaccess="RW"/>
	</register>
	<register id="TRNG_CONFIG" width="32" page="0" offset="24" internal="0" description="TRNG Configuration register">
		<bitfield id="NOISE_BLOCKS" description="" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="USE_STARTUP_BITS" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SCALE" description="" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="SAMPLE_DIV" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="READ_TIMEOUT" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="SAMPLE_CYCLES" description="" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="TRNG_ALARMCNT" width="32" page="0" offset="28" internal="0" description="TRNG Alarm Count Register">
		<bitfield id="ALARM_THRESHOLD" description="" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="RESERVED_0" description="" begin="14" end="8" width="7" rwaccess="R"/>
		<bitfield id="STALL_RUN_POKER" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SHUTDOWN_THRESHOLD" description="" begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="22" end="21" width="2" rwaccess="R"/>
		<bitfield id="SHUTDOWN_FATAL" description="" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SHUTDOWN_COUNT" description="" begin="29" end="24" width="6" rwaccess="R"/>
		<bitfield id="RESERVED_2" description="" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="TRNG_FROENABLE" width="32" page="0" offset="32" internal="0" description="TRNG FRO Enable Register">
		<bitfield id="TRNG_FROENABLE" description="" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="TRNG_FRODETUNE" width="32" page="0" offset="36" internal="0" description="TRNG FRO Detune Register">
		<bitfield id="TRNG_FRODETUNE" description="" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="TRNG_ALARMMASK" width="32" page="0" offset="40" internal="0" description="TRNG Alarm Mask Register">
		<bitfield id="TRNG_ALARMMASK" description="" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="TRNG_ALARMSTOP" width="32" page="0" offset="44" internal="0" description="TRNG Alarm Stop Register">
		<bitfield id="TRNG_ALARMSTOP" description="" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="TRNG_RAW_L" width="32" page="0" offset="48" internal="0" description="Main Shift Register Access Registers">
		<bitfield id="TRNG_RAW_L" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_RAW_H" width="32" page="0" offset="52" internal="0" description="Main Shift Register Access Registers">
		<bitfield id="TRNG_RAW_H" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_SPB_TESTS" width="32" page="0" offset="56" internal="0" description="TRNG Tests Control/Status RegisteR">
		<bitfield id="REPCNT_CUTOFF" description="" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="RESERVED_0" description="" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="APROP_64_CUTOFF" description="" begin="13" end="8" width="6" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="APROP_512_CUTOFF" description="" begin="24" end="16" width="9" rwaccess="RW"/>
		<bitfield id="RESERVED_2" description="" begin="27" end="25" width="3" rwaccess="R"/>
		<bitfield id="SHOW_COUNTERS" description="" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SHOW_VALUES" description="" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="APROP_64_FAIL" description="" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="APROP_512_FAIL" description="" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="TRNG_COUNT" width="32" page="0" offset="60" internal="0" description="TRNG Counter Access Register">
		<bitfield id="SAMPLE_CYC_CNT" description="" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="NOISE_BLK_CNT" description="" begin="20" end="16" width="5" rwaccess="R"/>
		<bitfield id="RESERVED_0" description="" begin="23" end="21" width="3" rwaccess="R"/>
		<bitfield id="SAMPLE_CYC_EXT" description="" begin="29" end="24" width="6" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_0" width="32" page="0" offset="64" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_RUN_CNT" width="32" page="0" offset="64" internal="0" description="Bits and runs counter states Register">
		<bitfield id="RUN_TEST_COUNT" description="" begin="14" end="0" width="15" rwaccess="R"/>
		<bitfield id="RUN_STATE" description="" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="RUN_LENGTH_COUNT" description="" begin="21" end="16" width="6" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_1" width="32" page="0" offset="68" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_RUN_1" width="32" page="0" offset="68" internal="0" description="Counters for 1-bit 0/1 runs Register">
		<bitfield id="RUN_1_COUNT_ZEROES" description="" begin="11" end="0" width="12" rwaccess="R"/>
		<bitfield id="RUN_1_COUNT_ONES" description="" begin="27" end="16" width="12" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_2" width="32" page="0" offset="72" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_RUN_2" width="32" page="0" offset="72" internal="0" description="Counters for 2-bit 0/1 runs Register">
		<bitfield id="RUN_2_COUNT_ZEROES" description="" begin="11" end="0" width="12" rwaccess="R"/>
		<bitfield id="RUN_2_COUNT_ONES" description="" begin="27" end="16" width="12" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_3" width="32" page="0" offset="76" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_RUN_3" width="32" page="0" offset="76" internal="0" description="Counters for 3-bit 0/1 runs Register">
		<bitfield id="RUN_3_COUNT_ZEROES" description="" begin="11" end="0" width="12" rwaccess="R"/>
		<bitfield id="RUN_3_COUNT_ONES" description="" begin="27" end="16" width="12" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_4" width="32" page="0" offset="80" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_RUN_4" width="32" page="0" offset="80" internal="0" description="Counters for 4-bit 0/1 runs Register">
		<bitfield id="RUN_4_COUNT_ZEROES" description="" begin="11" end="0" width="12" rwaccess="R"/>
		<bitfield id="RUN_4_COUNT_ONES" description="" begin="27" end="16" width="12" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_5" width="32" page="0" offset="84" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_RUN_5" width="32" page="0" offset="84" internal="0" description="Counters for 5-bit 0/1 runs Register">
		<bitfield id="RUN_5_COUNT_ZEROES" description="" begin="11" end="0" width="12" rwaccess="R"/>
		<bitfield id="RUN_5_COUNT_ONES" description="" begin="27" end="16" width="12" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_6" width="32" page="0" offset="88" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_RUN_6" width="32" page="0" offset="88" internal="0" description="Counters for 4-bit 0/1 runs Register">
		<bitfield id="RUN_6_COUNT_ZEROES" description="" begin="11" end="0" width="12" rwaccess="R"/>
		<bitfield id="RUN_6_COUNT_ONES" description="" begin="27" end="16" width="12" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_7" width="32" page="0" offset="92" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_MONOBITCNT" width="32" page="0" offset="92" internal="0" description="Monobit Test Register">
		<bitfield id="MONOBIT_COUNT" description="" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_8" width="32" page="0" offset="96" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_POKER_3_0" width="32" page="0" offset="96" internal="0" description="Poker Test Register">
		<bitfield id="POKER_COUNT_0" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_1" description="" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_2" description="" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_3" description="" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_9" width="32" page="0" offset="100" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_POKER_7_4" width="32" page="0" offset="100" internal="0" description="Poker Test Register">
		<bitfield id="POKER_COUNT_4" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_5" description="" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_6" description="" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_7" description="" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_10" width="32" page="0" offset="104" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_POKER_B_8" width="32" page="0" offset="104" internal="0" description="Poker Test Register">
		<bitfield id="POKER_COUNT_8" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_9" description="" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_A" description="" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_B" description="" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="TRNG_PS_AI_11" width="32" page="0" offset="108" internal="0" description="DRBG Vector Registers">
		<bitfield id="VECTOR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TRNG_POKER_F_C" width="32" page="0" offset="108" internal="0" description="Poker Test Register">
		<bitfield id="POKER_COUNT_C" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_D" description="" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_E" description="" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="POKER_COUNT_F" description="" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="TRNG_TEST" width="32" page="0" offset="112" internal="0" description="TRNG Test Register">
		<bitfield id="TEST_EN_OUT" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TEST_PATT_FR" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TEST_PATT_DET" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TEST_SHIFTREG" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CONT_POKER" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TEST_KNOWN_NOISE" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TEST_AES_256" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TEST_SP_800_90" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TEST_SELECT" description="" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="TEST_NOISE" description="" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TEST_SPB" description="" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_0" description="" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="TEST_PATTERN" description="" begin="27" end="16" width="12" rwaccess="RW"/>
		<bitfield id="FRO_TESTIN2_NOT" description="" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="FRO_TESTIN3" description="" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="FRO_TESTIN4" description="" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="TEST_IRQ" description="" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="TRNG_BLOCKCNT" width="32" page="0" offset="116" internal="0" description="TRNG Block Count Register">
		<bitfield id="RESERVED_0" description="" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="BLOCK_COUNT" description="" begin="31" end="4" width="28" rwaccess="RW"/>
	</register>
	<register id="TRNG_OPTIONS" width="32" page="0" offset="120" internal="0" description="TRNG HW Options Register">
		<bitfield id="POST_PROCESSOR" description="" begin="2" end="0" width="3" rwaccess="R"/>
		<bitfield id="RESERVED_0" description="" begin="5" end="3" width="3" rwaccess="R"/>
		<bitfield id="NR_OF_FROS" description="" begin="11" end="6" width="6" rwaccess="R"/>
		<bitfield id="BUFFER_SIZE" description="" begin="14" end="12" width="3" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="PR_TEST" description="" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CONDITIONER" description="" begin="18" end="17" width="2" rwaccess="R"/>
		<bitfield id="DETUNING_OPTION" description="" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="RESERVED_2" description="" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="APROP_512" description="" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="RESERVED_3" description="" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="AUTO_DETUNE" description="" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="DETUNE_COUNT" description="" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="TRNG_EIP_REV" width="32" page="0" offset="124" internal="0" description="TRNG EIP HW Rev">
		<bitfield id="BASIS_EIP_NUMBER" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="COMPLEMENT_OF_BASIC_EIP_NUMBER" description="" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="HW_PATCH_LEVEL" description="" begin="19" end="16" width="4" rwaccess="R"/>
		<bitfield id="MINOR_HW_REVISION" description="" begin="23" end="20" width="4" rwaccess="R"/>
		<bitfield id="MAJOR_HW_REVISION" description="" begin="27" end="24" width="4" rwaccess="R"/>
		<bitfield id="RESERVED_0" description="" begin="31" end="28" width="4" rwaccess="R"/>
	</register>
</module>
